{
  "allen-lin": "Hi this is Allen. I am a 2nd yr phd student advised by Prof. James Caverlee. My research so far focuses on leveraging deep reinforcement learning and natural language processing to enhance personalization and fairness in recommender systems. Nice meeting everyone today!!",
  "siddhant-thakur": "Howdy, this is Siddhant, but you guys can call me Sid. I am a 1st year MS student. I am primarily interested in NLP and Computational Social Science, so tackling stuff like political or gender bias in recommender systems or text sources (news articles and such). Totally random fact about me would be that I am considering picking up streaming games on Twitch in the future to get over my social awkwardness :3. 'Twas an awesome class today, looking forward to the semester!",
  "sravan-sriram": "Hi, I'm Sravan. I'm a senior undergraduate computer science student who is taking this class through the fast track program. I intend to continue my education with a master's in computer science after my bachelor's degree!",
  "laren-spear": "My name is Laren (pronounced like Karen but with an L), and I’m a 2nd year MS student. My research is related to breaking large language models. Fun fact about me is that I used to be a DJ.",
  "tony-yang": "Howdy, I am Tony and I am a 1st semester Master's student, just graduated from here with my bachelor's this past December. If I could pick any career in the world, I would be a police officer (check out my profile picture).",
  "rishabh-bassi": "Hi All, I am Rishabh Bassi 1st year Masters in Computer Science student. I work as Research Assistant on SAR project. Fun fact about me is I love bboying. Looking forward to meet you all.",
  "evelyn-crowe": "Hi everyone! My name is Evelyn and I'm in the last semester of my Masters (non-thesis). Super excited for this course! A fun fact about me is that I couldn't whistle at all until spring 2020, and then something magically changed and now I whistle all the time, to the deep chagrin of my roommate",
  "jeya-chandu": "Howdy! I am Jeya Krishna Chandu. I prefer to be addressed as Chandu. I'm a graduate student. Fun fact about me: I love automobiles, especially motorcycles. Let's catch up soon.",
  "haoran-liu": "Howdy! My name is Haoran (pronounced like how-ran). I am a 3rd yr phd student advised by Prof. James Caverlee. My research area is graph neural networks. Fun fact about me: I had practiced martial arts for three years when I was a kid.",
  "aayush-gautam": "Howdy! My name is Aayush (pronounced aa-you-sh). I am a first year MS student interested in natural language understanding and deep neural networks. Interesting fact: I am also into philosophy and currently reading about Absurdism. I just finished reading The Fall by Albert Camus",
  "snehith-bikumandla": "Howdy! My name is Snehith. I am a first-year Master's student interested in Artificial Intelligence and Cybersecurity. A fun fact about me is that I enjoy traveling and watching anime. I am excited to meet you all.",
  "krishnan-prashanth": "Hi, I'm Prashanth! I'm a senior undergrad comp sci student who is taking this class because I am really interested in this topic and want to learn as much as possible! An interesting fact about me is I'm reading the Foundation series by Isaac Asimov.",
  "ga-nan": "Hi guys, my name is Ga Nan. I am very interested in languages (human languages). I look forward to connecting our course to my interests in languages and get to know you all",
  "ravindranath-kv": "Hi; My name is Ravindranath (Try to pronounce it). If you find it difficult, you can call me by my last name 'kv'. Current fun fact: I'm composing a song with audio clips of my friend",
  "chinmay-sawkar": "Hi My name is Chinmay. I am a masters student with interest in machine learning and AI. I took this course to learn more how search engines and recommender systems can be efficiently designed and developed. I like to play soccer and also I am a huge soccer fan and look forward to meeting you all.",
  "youngki-kim": "Hi my name is Youngki from south Korea. I am a masters student and this will be my last semester! My interested are is security. One of my fun fact is that my wife and I will have first baby  on march.",
  "sravani-nimmagadda": "Howdy!! I am Sravani, 1st year Masters in data science. I love to play basketball and am a huge Cricket fan :) Current fun fact: Watching The vampire diaries (and yeah, interested to do some research on vampires)",
  "dylan-nguyen": "Howdy! I'm Dylan and I am in my senior year, taking this as fast track course towards my master's degree. I am excited to learn a lot in this course! Fun fact: I went on a study abroad trip in Singapore this past winter break (I took cloud computing), and I got back Sunday evening so I am still recovering from jet lag.",
  "vivek-vamsi-inala": "Howdy All! I'm Vivek, pursuing my 1st year of graduate studies in Computer Science. I took this course to learn more about IR systems and expand my current understanding gained from taking IR during my undergrad. hmu if you ever want to discuss or play Cricket! Loved the energy and interaction in the first class. Looking forward to some great learnings & fun!",
  "dushyant-rathore": "Howdy! I’m Dushyant and I am a final year MCS student. Looking forward to some interesting learnings in the class. Fun Fact - I’m a huge cricket fan and a binge watcher.",
  "mounika-balivada": "Howdy, I am Mounika first year Masters student in computer science. I am exited to learn more about design of recommender systems in this course. I enjoy running and I love to taste different food cuisines. Current fun fact: Became an anime lover recently, halfway through Death note:)",
  "sijing-yu": "Howdy, I am Sijing, and this is my last semester as a master student here. Fun fact about me: I am a huge music fan (mainly instrumental) and play a few instruments",
  "millennium-bismay": "Howdy! I am Millennium (or call me Mill). I am a 1st year MSCS student. I am interested in Recommender Systems and plan to work (hopefully) on the recommendation of memes (or any image) from text searches in near future. I am a football aficionado and a movie, anime and series buff. Looking forward to some great learning.",
  "anuska-pant": "Howdy, I am Anuska. I am a first year CS student. I like skipping classes and sleeping at home but hopefully I can make it this semester.",
  "vaidhyesh-padma-sundar": "Howdy everyone, Im Vaidhyesh, a 2nd year master’s student looking to graduate this semester. I am a fan of popular techologies like AI and Recommender systems and I hope to work on the same in the future. My hobbies are mainly to watch and play football (the european one)!",
  "anushka-garg": "Howdy! I am Anushka, 1st year MSCS student. Though I have some experience in Software Engineering, I am still figuring out my area of interest. I like playing badminton, watching random youtube videos and chilling out with friends.",
  "yash-vijaykumar-patel": "Howdy, my name is Yash! I’m a first-year master’s student in the CS department. I’m excited to be taking this course on information retrieval. In my free time, you can find me watching any and all sports - so if you’re ever in need of a sports buddy, I’m your guy. Despite being Aggie fan, I’m still a big believer in the 'football vs soccer' debate. But, as we all know, the one thing that’s inarguable at A&M is... IN JIMBO WE TRUST...or maybe not? :)",
  "pranav-anand-taukari": "Howdy! I am Pranav, 1st year MSCS student from India. I have a keen interest in languages and can speak 7, 9 if you count Python and C++ xD. Two fun facts about me I enjoy playing poker and I was in a movie with Aishwarya Rai Bachchan!",
  "maria-teleki": "Howdy! My name is Maria, and I'm a 1st year phd student in CS interested in ML, and I'm a loud & proud Aggie My fun fact: I make awesome homemade bread.",
  "yatin-gupta": "Howdy, I am Yatin. I am a first-year CS student. I am interested in dealing with challenges involved with scale (large users, big data) and distributed systems. A fun fact about me is I like trying out new things and currently learning ballroom dancing!",
  "abhishek-maurya": "Howdy Guys, I am Abhishek Maurya (old buddies calls me Abhi). I am a 1st Year Graduate student. Loved the teaching interaction in first class. Gripping fact about me is I have been a marathon runner for a long time. Looking forward to have an interesting semester!",
  "ashutosh-chauhan": "Howdy!! I am Ashutosh, my friends call me Ashu, first year MCS student. I love to explore new fields and techs - did bachelor’s in Electrical, worked in HMI R&D in an automotive industry for 4 years and now switched to CS. Fun fact about me is I like to sketch and paint",
  "chengkai-liu": "Howdy! I'm Chengkai, a first-year Ph.D. student in computer science, working on AI and machine learning. I am passionate about recommender systems. I worked on recommendation models for an App Store with thousands of millions of users during my undergraduate!",
  "shurui-gui": "Howdy! I am Shurui, a third year CS Ph.D. student, working on graph out-of-distribution problem. Fun facts about me: I’m an audiophile even though I’m not good at listening. XD I love doing all interesting experiments. Looking forward to what interesting things we will learn in this semester!",
  "hongyi-ling": "Howdy! My name is Hongyi. I am a 2nd year Ph.D. student. My research is about graph neural networks and fairness.  Fun facts about me: I love playing basketball and video games. I am a platinum player in League of Legends.",
  "xiner-li": "Howdy I’m Xiner, second year Ph.D. student in CS. I work on graph deep learning and OOD at the moment. Facts about me: I’ve been planning on workouts for a year and Rec Sports emailed me asking why I never visit:( I feel this course’s gonna be much more fun than I expected. Looking forward to hearing about Cav’s family and vacations!",
  "ashish-kumar": "Howdy! My name is Ashish Kumar, I am first year graduate student.  Fun fact about me- I can juggle. Looking forward to have an awesome semester!!",
  "prajwal-iyer": "Howdy, I'm Prajwal, first year masters student. I like hip-hop and r&b music and ranking silver in Valorant Looking forward to seeing more memes in class!",
  "tanu-shree": "Howdy everyone! I am Tanu Shree. I am a second year graduate student in CS. I like Art. I love to sing and I have been a lead female vocalist in a Texas based Indian music band performing multiple large scale events. Excited to learn new things this semester!",
  "bhavya-shah": "Howdy! I am Bhavya Shah, first year MS CE Grad student from India. I am a trained Classical Dancer, I love baking and meeting new people! Excited for the coming semester.",
  "anshul-sharma": "Howdy! I am Anshul. I am a first-year CS student. I am interested in Neural Networks and NLP. I have worked for Oracle and had a project last year on reducing the SQL query processing time in the Database, thus enabling fast information retrieval. I like to play soccer and cricket. Looking forward to learn interesting things this semester!!",
  "shilpa-mukhopadhyay": "Howdy! I am Shilpa Mukhopadhyay, a first year MS CS student, working on Sketch recognition for children motor skills development. I have worked on the smart cameras and GPS of self driving cars at Continental Automotive and on Voice modules at Qualcomm. Fun fact about me: i am a belly dancer, vocalist and a rifle shooter!",
  "abhiraj-singh-rathore": "Howdy! I am Abhiraj. I am a first year MS CS student. I am interested in algorithms, machine learning and deep learning. I absolutely love football (People call it soccer here in USA, I mean c'mon guys it's a sport that involves your foot!) I am a huge messi fan. Still can't get over him lifting the world cup. Looking forward to the semester.",
  "md-maklachur-rahman": "I am Md Maklachur Rahman, a second-year PhD student in CS working as a GRA at Sketch Recognition Lab. My research focuses on developing a class-agnostic visual object tracker using deep learning that can track any arbitrary objects in challenging scenarios with maintaining real-time tracking speed and high accuracy. The fun fact about me is that I love cooking, going fishing, and planting trees.",
  "ram-sankar": "Hi, My name is Ram Sankar. I am a first year Masters student. I love memes and sports. Fun fact about me: I never thought I would go to grad school but here I am",
  "sankalp-chapalgaonkar": "Howdy!! This is Sankalp, a first year graduate student in Computer Science. Prior to landing in Aggieland, I was working with JP Morgan Chase as a software developer in their Wealth Management Department. I love playing video games, Cricket and enjoy swimming. Hate cooking (however a big time foodie) but trying my best in last six month. Looking forward for an exciting semester and hear about some crisp (and of course controversial) stories about tech giants (and why Netflix>>prime) from Cav.",
  "suman-kumari": "Howdy! Myself Suman! First year graduate student in CS. I have worked on memory products(SD, uSD, SSDs) for quite sometime. Now pursuing masters to learn new and trending stuffs like Machine learning, data mining and NLP. Fun fact about me is: I like exploring new things and try not to visit same restaurant second time. Looking forward to great learning and fun filled semester!",
  "divyansh-bokadia": "Howdy!! I am Divyansh Bokadia, a first year graduate student in CS. I worked with Visa as a Senior Data Engineer before deciding to take the big step of pursuing masters. I am very excited to expand my knowledge on different horizons in this ever developing field. Fun fact about me: I love watching football and am a big fan of Manchester United. P.S. Hopefully they end the trophy drought this season. Looking forward to an exciting semester filled with new learnings!",
  "kwangkyu-hwang": "Hi my name is Kwangkyu. I’m a first year in MS in CS. Previously I majored in EE in both BS and MS which was focused on HW, but decided to pursue another degree for CS because of a lot of possibility and opportunities in Software Engineering. But the news I hear these days makes me doubt my choice. Haha… I want to prove that my choice was not wrong. Nice to meet you guys.",
  "md-imanul-huq": "Hello, This is Md Imanul Huq. I am from Bangladesh. I am doing PhD in CSE and working as Teaching Assistant. This is my second year. I am new to slack. Please forgive me if I miss any etiquette. Thank you",
  "satish-kumar-reddy-madduri": "Howdy everyone, I am Satish, I'm a first year MCS student. I loved the way professor interacted in our first class. Fun fact about me would be I would love to watch sports (cricket & badminton) rather than playing them. Looking forward for interesting semester.",
  "matthew-kocmoud": "Howdy all, I'm Matthew, and I'm on my last semester for a non-thesis CS Masters. Got my undergrad in '15 and decided to come back for round #2 while working full-time as a software developer. I've got 2 young kids and very supportive wife at home. Fun facts: I have an identical twin, come from a family of 9 kids, and I own the email alias tamu.edu@tamu.edu (please don't spam me lol). Glad to be a part of such a fun class!",
  "sergio-herrera": "Howdy everyone! My name is Sergio Herrera and I am a first year MCS student! One hobby that I have been getting into is to cook steaks! I love trying different types of seasoning and herbs and see how it influences the end result of the steak. Looking forward to this class!",
  "siddharth-devulapalli": "Howdy everyone! My name is Siddharth. I am a first-year MCS student. I worked in the field of Data Science for the past couple of years. I got bored and came here! I'm excited about this class, I like the way the prof interacts and I'm eagerly waiting to talk about ChatGPT kind of stuff. Fun fact: I sing, click pictures and try different cooking experiments. Looking forward to this class!",
  "sahithi-ravipati": "Howdy, I'm Sahithi Ravipati and I am a first year CS Master's student. I'm an avid reader and on most days I tend to prefer books to people",
  "swati": "Hi, I’m Swati. I am a first year MS Data Science Student. I worked for four years as a Data Engineer and got bored of it so came here to explore and learn more! Fun Fact: I love changes. To break up the monotony in my life, I adore making significant modifications.",
  "stefan-wu": "Howdy. This is Stefan, a first-year MSCS student. I am glad to be in 670 this semester. One fact: I have recently been learning to cook my own meals and put out stove fires.",
  "alekhya-duba": "Hello everyone! I am Alekhya, a second year MCS student. A little late to the party but I finally made it!! I worked in the software industry for 6 years with a non-CS engineering degree and here I am to finally get one. I enjoy talking about Autonomous Vehicles and aspire to be a part of this new paradigm shift. Fun fact: Loves to travel and can speak 4 languages (Not counting the programming languages )",
  "md-messal-monem-miah": "Hi, this is Messal. I am a 2nd year PhD student. Fun (!) fact: I am a procrastinator and perfectionist. I cannot start working on something until it is super last minute and also cannot compromise on quality. Thank  God this course has late days.",
  "sai-ramana": "Howdy, I am Sai Ramana, a first year MSCS student. I’m currently doing research in NLP. Fun fact: I follow Sports, Netflix shows and contemporary politics. Excited about this course and glad to meet you all!",
  "akiri-venkata-prabhanda-sahithi": "Howdy fellow classmates! I'm Sahithi Akiri, joined MCS program in Fall 2022. I worked as a Data Engineer in a FinTech company for the last two years after my Undergrad. I enjoy cooking, dancing to Bollywood music and painting once in a while. Looking forward to a fun and excited semester with you all!",
  "rohan-gupta-kandikonda": "Hello all, I am Rohan, pursuing my Masters in Computer Science. Prior to this, I worked as a Software Developer at Barclays.  I didn't want to miss the most exciting professor's class and the most exciting course, so I am here after all the hardship faced (It was actually tough to secure a seat in this class xD) Fun Fact: I wrote a novel at the age of 12. (I guess I am the youngest author in my country :p) Apart from that I sing, dance, play guitar and also like to read about startups. Hope to build a new ChatGPT by the end of the semester",
  "po-chieh-wang": "Howdy! I am Po-Chieh Wang, a first year masters student in computer engineering. I'm from Taiwan and I like to play soccer and watch Netflix! Nice to meet you all!",
  "erik-mueller": "Howdy! I am Erik. I am a fist year, second semester masters student in computer science. I did my undergraduate work in petroleum engineering and used to work as a quality engineer. I am an avid fan of almost all sports and also love learning about history. A fun fact is I am actually a fourth generation Aggie.",
  "ajinkya": "Howdy everyone! I am Ajinkya (you can also call me Aj). I am a first year MCS student. I am interested in cloud computing, cooking and anime(just caught up with Demon Slayer and open to new suggestions!!). Looking forward to the semester!",
  "sneha-mishra": "Howdy Guys! I'm Sneha, a first-year MSDS student. I have worked in the healthcare industry in data analyst, and product owner roles for three years before joining A & M. Looking forward to exploring and engaging in this fun-filled yet intriguing course! Apart from that, I am passionate about dancing, singing, and getting indulged in the fictional world of books.",
  "varshani-reddy-patlolla": "Howdy!! I’m Varshani Reddy, a first year Master of Computer Science student . For the last couple of years I worked on Bigdata and Machine learning. I enjoy cooking, watching tv series and f1. Fun fact: I just found an available seat and enrolled in the 670 course ! Congratulations to me :). Looking forward to learning with y’all!",
  "xiangrong-li": "Howdy! I’m Xiangrong Li (or you can call me Gillian), a first year MSCS student. Currently, I’m still trying to figure out what I would like to do for my thesis. I’m very looking forward to learning about recommendation system through this course! Also happy Chinese New Year! (Btw, it’s the year of the rabbit :) )",
  "rajendra-thottempudi": "Howdy! I am Rajendra, a first year MSCS student. Looking forward to learn about recommendation systems and for a great semester ahead!",
  "debajoy-mukherjee": "Howdy!!! This is Debajoy Mukherjee, a first year MSCS student. I love playing cricket and bathroom singing. I had to beg people to exchange seats to get into this course and honestly 50 min is too less for the lectures. Have a great semester ahead!!!",
  "pravija-danda": "Hurray!! kudos to me, I finally made it into this course.  I am Pravija, a first-year MSCS student. I worked as a Data Analyst. I am a foodie and I enjoy cooking a lot. Looking forward to a fun-filled semester.",
  "chetan-nagavathi-chendrayudu": "Howdy Everyone!!! I'm Chetan, a first-year MSCS student eager to learn more about recommendation systems. Fun fact: I am a movie buff, and I like to watch Master Chef without the intention of cooking xD. Anticipating a fantastic semester and lectures ahead!!",
  "chen-yun-cheng": "Howdy! I am Cheng-Yun Cheng, a first year masters student in computer science. Fun fact: I enjoy playing video games and watching animes. Also, I love boba milk tea. It is the best beverage ever. Looking forward to the semester and nice to meet you all!",
  "noah-pang": "Howdy, I'm Noah, a masters computer science student and I enjoy playing board games. I'm looking forward to the semester ahead with everyone.",
  "neel-akash": "Hey! I'm Neel, a first-year master's CS student. I waste my time playing video games and applying for internships that end in auto-rejections. LFT: Will join any group. Have experience with C, Python, Java, and a bunch of web-dev tech. Theoretically sound with ML and RL."
}